{
  "title": "Software Development Engineer",
  "djangoJobId": 1,
  "description": "Prime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing experience and find their favorite movies, series, documentaries, and live sports – including Amazon MGM Studios-produced series and movies; licensed fan favorites; and programming from Prime Video add-on subscriptions such as Apple TV+, Max, Crunchyroll and MGM+. All customers, regardless of whether they have a Prime membership or not, can rent or buy titles via the Prime Video Store, and can enjoy even more content for free with ads.\n\nAre you interested in shaping the future of entertainment? Prime Video's technology teams are creating best-in-class digital video experience.\n\nAs a Prime Video technologist, you’ll have end-to-end ownership of the product, user experience, design, and technology required to deliver state-of-the-art experiences for our customers. You’ll get to work on projects that are fast-paced, challenging, and varied. You’ll also be able to experiment with new possibilities, take risks, and collaborate with remarkable people.\n\nWe’ll look for you to bring your diverse perspectives, ideas, and skill-sets to make Prime Video even better for our customers. With global opportunities for talented technologists, you can decide where a career Prime Video Tech takes you!\n\nThe ideal candidate will have:\nStrong background in OO design.Solid time mgmt./communication skillsAbility to support multiple projects at a time.Brings strong opinions but loosely held. (Lets best idea rise to the top.)Comfort adapting to new development environments and changing business requirements, learning new systems, creating reliable/maintainable code, and finding creative and scalable solutions to difficult problems.\n\nA day in the life\nWhat you’ll do:\nOwn architecture and feature development for our 3rd party living room Video Player.Partner with other engineers to ideate, design, and build scalable software solutions.Drive test and release automations to increase system reliability and speed to market.Collaborate with product managers to influence decisions that deliver customer value.Shape the future of Amazon’s Prime Video on living room devices.\n\nAbout the team\nOur team is made up of coders and craftspeople who are as meticulous about aesthetics as they are about functionality and performance. We seek diverse perspectives to create sports experiences that delight all customers.\n\nWe move fast, but prioritize long-term decisions that will scale as our sports offerings grow. We're not afraid of big challenges - in fact, we thrive on them. If you love solving complex problems and building the future of sports entertainment, we want to hear from you.\n\nBASIC QUALIFICATIONS3+ years of non-internship professional front end, web or mobile software development using JavaScript, HTML and CSS experience3+ years of computer science fundamentals (object-oriented design, data structures, algorithm design, problem solving and complexity analysis) experienceExperience using JavaScript frameworks such as angular and react\n\nPREFERRED QUALIFICATIONS2+ years of agile software development methodology experience1+ years of software development using Rust\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from 129,300/year in our lowest geographic market up to 223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.\nJob details\nUSA, WA, Seattle\nUSA, VA, Arlington\nPrime Video\nSoftware Development",
  "salary": 129300,
  "experienceLevel": 2,
  "location": ["Seattle, WA, USA", "Arlington, VA, USA"],
  "jobType": "Full-time",
  "requirements": [
    "Strong background in OO design.",
    "Solid time mgmt./communication skills.",
    "Ability to support multiple projects at a time.",
    "Brings strong opinions but loosely held. (Lets best idea rise to the top.)",
    "Comfort adapting to new development environments and changing business requirements, learning new systems, creating reliable/maintainable code, and finding creative and scalable solutions to difficult problems.",
    "3+ years of non-internship professional front end, web or mobile software development using JavaScript, HTML and CSS experience.",
    "3+ years of computer science fundamentals (object-oriented design, data structures, algorithm design, problem solving and complexity analysis) experience.",
    "Experience using JavaScript frameworks such as angular and react.",
    "2+ years of agile software development methodology experience.",
    "1+ years of software development using Rust."
  ],
  "position": 1,
  "company": "Prime Video",
  "applications": [],
  "createdAt": "2025-08-19T12:00:00Z",
  "updatedAt": "2025-08-19T12:00:00Z",
  "__v": 0
}
